# インストール先の指定
cask_args appdir: "/Applications"

# 外部ライブラリをインストール
tap "homebrew/core"
tap "homebrew/cask"

#------------------------------------------
# CLIアプリケーションの管理
#------------------------------------------
brew "asdf" # バージョン管理システム
brew "mas"
brew "yarn"
brew "tree"
brew "git"
brew "git-lfs"
brew "docker"
brew "awscli"
brew "jq"
brew "ag"
brew "jump"
brew "fzf"
brew "bat"
brew "gpg"
brew "hstr"

#------------------------------------------
# デスクトップアプリケーションの管理
#------------------------------------------
# ブラウザ
cask "arc"
cask "sidekick"
cask "google-chrome"
cask "firefox"

# エディター・IDE
cask "visual-studio-code"
cask "pycharm"
cask "phpstorm"
cask "jetbrains-toolbox"
cask "jupyterlab"

# ターミナル
cask "iterm2"
cask "warp"

# API関連
cask "postman"
cask "insomnia"
cask "mockoon"

# DB関連
cask "mysqlworkbench"
cask "nosql-workbench"
cask "dynamodb-local"
cask "tableplus"

# Git関連
cask "fork"

# デザイン・設計書関連
cask "figma"
cask "drawio"

# ファイル転送ツール
cask "transmit"

# コミュニケーションツール
cask "slack"

# その他
cask "fig"
cask "flux"
cask "rectangle"
cask "notion"
cask "docker"
cask "kindle"
cask "alfred"
cask "1password"

#------------------------------------------
# AppStoreアプリケーションの管理
#------------------------------------------
mas "LINE", id: 539883307